[
  {
    "id": 1,
    "name": "Your bedroom.",
    "description": "An unmade bed stands in the corner. A wardrobe is next to the door, unused, with a pile of clothes in front of it. There is a small table next to the bed holding some of your adventuring equipment. A door to the north leads out of the bedroom.",
    "exits": {
      "north": 2,
      "south": 0,
      "east": 0,
      "west": 0
    }
  },
  {
    "id": 2,
    "name": "Your living room.",
    "description": "A small room with a table and chairs in the middle. Through the windows you can see the front gate and a garden. To the west you can see your kitchen and north is the door that leads outside. Your bedroom door is south.",
    "exits": {
      "north": 0,
      "south": 1,
      "east": 0,
      "west": 3
    }
  },
  {
    "id": 3,
    "name": "Your kitchen.",
    "description": "A fireplace with a small chimney is on the back wall with a pot hanging over it. The warmth form the fire is pleasant. You can see your living room to the east.",
    "exits": {
      "north": 0,
      "south": 0,
      "east": 2,
      "west": 0
    }
  },
  {
    "id": 4,
    "name": "In front of your small cabin.",
    "description": "A short, paved path leads north to your front gate. To the south is the door to your hut and east is your garden.",
    "exits": {
      "north": 5,
      "south": 2,
      "east": 6,
      "west": 0
    }
  },
  {
    "id": 5,
    "name": "On the path outside your gate.",
    "description": "The gate to you cabin creaks in the wind to the south. In the distance to the east you can see the village. To the west is a pond.",
    "exits": {
      "north": 0,
      "south": 4,
      "east": 7,
      "west": 9
    }
  },
  {
    "id": 6,
    "name": "Your garden.",
    "description": "A few fruit trees line the fence and along the wall of the cabin there is a vegatable garden.",
    "exits": {
      "north": 0,
      "south": 0,
      "east": 0,
      "west": 4
    }
  },
  {
    "id": 7,
    "name": "On the path towards town.",
    "description": "To the east you can see the general store and the town beyond. To the west stands your cottage.",
    "exits": {
      "north": 0,
      "south": 0,
      "east": 8,
      "west": 5
    }
  },
  {
    "id": 8,
    "name": "Outside a general store.",
    "description": "The village's general store stands before you. There are some wares outside on stands and the door is open. To the west, a path leads out of town.",
    "exits": {
      "north": 0,
      "south": 0,
      "east": 0,
      "west": 7
    }
  },
  {
    "id": 9,
    "name": "On the path towards the pond.",
    "description": "To the west you can see the pond and sound of ducks can be heard. The path to the east leads to your cottage.",
    "exits": {
      "north": 0,
      "south": 0,
      "east": 5,
      "west": 10
    }
  },
  {
    "id": 10,
    "name": "Beside the pond.",
    "description": "A pond is before you. The rushes growing around the edges sway in the breeze. A family of ducks plays on the water. The path leads east.",
    "exits": {
      "north": 0,
      "south": 0,
      "east": 9,
      "west": 0
    }
  }
]